<a href="https://colab.research.google.com/github/prashanta4coursera/Pandas/blob/master/Practice_Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Step 1 : Importing all the libraries :**

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**Step 2 : Importing the dataset from** https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv

In [5]:
drinks_df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv', index_col = 0)
drinks_df.head()

             beer_servings  ...  continent
country                     ...
Afghanistan              0  ...         AS
Albania                 89  ...         EU
Algeria                 25  ...         AF
Andorra                245  ...         EU
Angola                 217  ...         AF

[5 rows x 5 columns]


**Question 1: Which continent drinks more beer on average ?**

**Answer**  :

In [18]:
#groupby the continent column, applying to beer_servings and find the mean
#sort it in descending order. First value is the answer.
drinks_df.groupby('continent', as_index = True)[['beer_servings']].mean().sort_values(by = 'beer_servings', ascending = False)

           beer_servings
continent
EU            193.777778
SA            175.083333
OC             89.687500
AF             61.471698
AS             37.045455

**Question 2**:  **For each continent print the statistics for wine consumption?**

**Answer** :

In [20]:
# Describe function will provide the statistics data
drinks_df.groupby('continent')[['wine_servings']].describe()

          wine_servings
                  count        mean        std  min   25%    50%     75%    max
continent
AF                 53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS                 44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU                 45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC                 16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA                 12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

**Question 3: Print the mean alcohol consumption per continent for every column**

**Answer** :

In [21]:
# mean function on the column will provide the solution
drinks_df.groupby('continent').mean()

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF             61.471698  ...                      3.007547
AS             37.045455  ...                      2.170455
EU            193.777778  ...                      8.617778
OC             89.687500  ...                      3.381250
SA            175.083333  ...                      6.308333

[5 rows x 4 columns]

**Question 4: Print the median alcohol consumption per continent for every column**

**Answer** :

In [22]:
drinks_df.groupby('continent').median()

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF                  32.0  ...                          2.30
AS                  17.5  ...                          1.20
EU                 219.0  ...                         10.00
OC                  52.5  ...                          1.75
SA                 162.5  ...                          6.85

[5 rows x 4 columns]

**Question 5 : Print the mean, min and max values for spirit consumption**

**Answer** :

In [24]:
drinks_df.groupby('continent')[['spirit_servings']].agg(['mean','min','max'])

          spirit_servings
                     mean min  max
continent
AF              16.339623   0  152
AS              60.840909   0  326
EU             132.555556   0  373
OC              58.437500   0  254
SA             114.750000  25  302